0.org/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];					

internalField   uniform 0;							//Luft überall voreingestellt

boundaryField
{
	
    Inlet
    {
		type            variableHeightFlowRate;		//Füllung variiert mit Wasserstand
        lowerBound      0;
        upperBound      0.9;
        value           uniform 0;
    }
    Outlet
    {
		type            inletOutlet;				//Wasser kann frei aus-/einströmen
        inletValue      uniform 0;					//Wassereintritt unterbinden
        value           uniform 0;
	}
	Top
    {
        type            inletOutlet;				//Wasser kann frei aus-/einströmen
        inletValue      uniform 0;					//Wassereintritt unterbinden
        value           uniform 0;
    }
    WeirBottom
    {
        type            zeroGradient;
    }
	Walls
    {
        type            zeroGradient;
    }
	BottomFrontWeir
    {
        type            zeroGradient;
    }
    BottomTosbecken
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
