0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.e-11;

boundaryField
{
    Inlet {type zeroGradient; value uniform 0;}
	Outlet {type zeroGradient; value uniform 0;}
    Top {type zeroGradient; value uniform 0;}
	WeirBottom {type zeroGradient; value uniform 0;}
	Walls {type zeroGradient; value uniform 0;}	
	BottomTosbecken {type zeroGradient; value uniform 0;}	
    BottomFrontWeir {type zeroGradient; value uniform 0;}	
	/*sideSymmetry {type symmetryPlane; }
	defaultFaces {type empty;}*/
}

