0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	// 1
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
	
	// 3
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
	
	// 4
	Top
    {
        type            calculated;
        value           uniform 0;
    }
	
	WeirBottom
    {
        type            nutkWallFunction;	//Wandfunktion für dyn. turb. Energie
        value           uniform 0;
    }
	
	Walls
    {
        type            nutkWallFunction;	//Wandfunktion für dyn. turb. Energie
        value           uniform 0;
    }
	
	BottomTosbecken
    {
        type            nutkWallFunction;	//Wandfunktion für dyn. turb. Energie
        value           uniform 0;
    }
    BottomFrontWeir
    {
        type            nutkWallFunction;	//Wandfunktion für dyn. turb. Energie
        value           uniform 0;
    }
	/*
	sideSymmetry
	{
        type           symmetryPlane;	//symmetrische RB: wenn keine Wand erwünscht
    }
	defaultFaces
    {
        type            empty;			//Für 2D-Flächen optimal
    }
	*/
}


// ************************************************************************* //
