constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]  1e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
	//selten benötigt
	CrossPowerLawCoeffs	//interationsschemata (ähnlich wie taylorreihe)
	{
		nu0			nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
		nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
		m			m [ 0 0 1 0 0 0 0 ] 1;
		n			n [ 0 0 0 0 0 0 0 ] 0;
	}
	
	BirdCarreauCoeffs	//interationsschemata (ähnlich wie taylorreihe)
	{
		nu0			nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
		nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
		k			k [ 0 0 1 0 0 0 0 ] 99.6;
		n			n [ 0 0 0 0 0 0 0 ] 0.1003;
	}
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]  1.48e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;
	//selten benötigt
	CrossPowerLawCoeffs	//interationsschemata (ähnlich wie taylorreihe)
	{
		nu0			nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
		nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
		m			m [ 0 0 1 0 0 0 0 ] 1;
		n			n [ 0 0 0 0 0 0 0 ] 0;
	}
	
	BirdCarreauCoeffs	//interationsschemata (ähnlich wie taylorreihe)
	{
		nu0			nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
		nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
		k			k [ 0 0 1 0 0 0 0 ] 99.6;
		n			n [ 0 0 0 0 0 0 0 ] 0.1003;
	}
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.072; //Oberflächenspannung: ändert sich mit der Größe der Fläche natürlich!! 0.2 reagenzglass; ozean gegen 0: Schätzung: 0,072 für Wasser-Luft, wenn sonst unbekannt


// ************************************************************************* //
