system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
	grad(U)        cellLimited Gauss linear 0.9; 
}

divSchemes
{
    default             none;

	div(rhoPhi,U)      Gauss linearUpwind grad(U);
	div(phi,alpha)      Gauss vanLeer;
	div(phirb,alpha)    Gauss linear;
	div(phi,k)      Gauss upwind;
	div(phi,epsilon) Gauss upwind;
	div(phi,R)      Gauss upwind;
	div(R)          Gauss linear;
	div(phi,nuTilda) Gauss upwind;
	div((muEff*dev(T(grad(U))))) Gauss linear;
	div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
	alpha.water;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
