system/snappyHexMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          autoHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    geometry.stl
    {
        type triSurfaceMesh;
        regions
        {
            BottomFrontWeir
            {
                name BottomFrontWeir;
            }
            BottomTosbecken 
            {
                name BottomTosbecken;
            }
            Inlet
            {
                name Inlet;
            }
            Outlet
            {
                name Outlet;
            }
            Top
            {
                name Top;
            }
            Walls
            {
                name Walls;
            }
            WeirBottom
            {
                name WeirBottom;
            }
        }
    }
};

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 400000;
    minRefinementCells 100;
    nCellsBetweenLevels 3;

    features
    (
    );

    refinementSurfaces
    {
        geometry.stl
        {
            level (0 0);
            regions
            {
                NumberOne
    		    {
    		    	level (3 3);
    		    }
        	    NumberTwo
    		    {
    		    	level (2 2);
    		    }
            }
        }
    }

    resolveFeatureAngle 60;

    refinementRegions
    {
    }

    locationInMesh (50 50 50);
}